swak4foam/Examples/groovyBC/lookupDambreak/constant/alphaMove.data
// -*- c++ -*-
(
    (
        -1 (
            (-1 0)
            ( 1 0)
        )
    )
    (
        0.1 (
            (-1 0)
            ( 1 0)
        )
    )
    (
        0.3 (
            (-1 0)
            (0.2 0)
            (0.3 1)
            (0.4 1)
            (0.5 0)
            ( 1 0)
        )
    )
    (
        0.5 (
            (-1 0)
            (0.1 0)
            (0.2 1)
            (0.3 1)
            (0.4 0)
            ( 1 0)
        )
    )
    (
        0.6 (
            (-1 0)
            ( 1 0)
        )
    )
    (
        100 (
            (-1 0)
            ( 1 0)
        )
    )
)
